package com.example.tasks

/*
Task1:
Дано: Приложение с тремя экранами на базе Fragment, на каждом экране есть 2 кнопки -
для перехода на следующий экран и предыдущий. Реализовать базовый роутер для
навигации между фрагментами без использования дополнительных библиотек.

Task2:
Один раз запланировать WorkManager, который будет присылать уведомление о том,
что устройство находится на зарядке.

Task3:
Реализовать небольшую кастомную вью в виде прямоугольника. При каждом нажатии на
него он заполняется на 10%, цвет залитой части рандомно меняется. При достижении
100% все начинается заново.

Task4:
Необходимо спроектировать чат для android. Апп должен уметь выводить чаты,
сообщения чата, отправлять сообщения. Нужно рассказать как делать(подбор
фреймворков, библиотек).
 */